{
  "Spring": [
    "Explain what Micrometer is.",
    "Explain Spring transaction propagation attributes.",
    "What is dependency injection?",
    "Explain the flow of Spring transaction AOP.",
    "What is the difference between @Component, @Controller, @Service, and @Repository?",
    "Will a transaction work if @Transactional is declared on a private method?",
    "Explain how Spring transaction exception handling works."
  ],
  "JPA": [
    "What should you be careful about when setting Lazy Loading in a @OneToOne relationship?",
    "Explain the ID generation strategies in JPA.",
    "Explain the N + 1 problem in JPA.",
    "Explain what an EntityManager is.",
    "What are the ddl-auto options in JPA, what do they do, and when should they be used?",
    "How does Spring Data JPA determine if an Entity is new?",
    "Explain the caveats of using JPA Fetch Join with pagination."
  ],
  "Java": [
    "Explain the execution flow of a Java program.",
    "What is the advantage of specifying the initial capacity of JCF data structures?",
    "Explain covariance, contravariance, and invariance in Java generics.",
    "What’s the difference between casting an Object value to String and using String.valueOf()?",
    "Is a String object mutable or immutable? Explain why.",
    "Explain try-with-resources.",
    "How can you retrieve class information in Java?",
    "Explain defensive copying.",
    "Explain Call By Value and Call By Reference.",
    "Why use Record as a DTO?",
    "Explain identity vs equality.",
    "Why should equals and hashCode be overridden together?",
    "Explain shallow copy vs deep copy.",
    "Explain Checked Exception vs Unchecked Exception in Java.",
    "What is the Null Object Pattern?",
    "Explain ThreadLocal.",
    "What are thread pool saturation policies?",
    "What is the Template Method Pattern?"
  ],
  "JVM": [
    "What GC algorithms exist?",
    "What criteria does the JVM use to determine whether an object is eligible for GC?",
    "Explain Gradle."
  ],
  "Database": [
    "What is the difference between column-based DB and row-based DB?",
    "Explain the necessity of paging queries in RDB.",
    "Explain optimistic locking vs pessimistic locking.",
    "Explain database normalization.",
    "Explain ACID.",
    "Explain DB replication.",
    "Explain database indexes.",
    "What are transaction isolation levels?",
    "Explain concurrency control methods in database systems.",
    "What are gap locks and next-key locks in MySQL InnoDB, and how do they prevent phantom reads?",
    "What problems can occur if you don’t use a database connection pool?",
    "Explain shared locks vs exclusive locks.",
    "What is the difference between relational DB and non-relational DB?",
    "What is the difference between logical deletion and physical deletion?",
    "What are the types of NoSQL databases?"
  ],
  "Redis": [
    "How can you implement distributed locks with Redis?",
    "Why is Redis single-threaded?",
    "Explain the cache stampede problem."
  ],
  "HTTP": [
    "Explain the PRG pattern.",
    "Explain Keep Alive.",
    "What’s the difference between URI, URL, and URN?",
    "Explain HTTP/1.1 vs HTTP/2.0.",
    "What is REST?",
    "What is CORS?",
    "What does idempotency mean in HTTP methods?",
    "Explain the sequence of events when a user first accesses a website.",
    "What’s the difference between server-side rendering and client-side rendering?",
    "What is the difference between Connection Timeout, Socket Timeout, and Read Timeout?"
  ],
  "Network": [
    "What’s the difference between circuit switching and packet switching?",
    "What is DNS?",
    "Explain the difference between static IP assignment and dynamic IP assignment.",
    "Why is NAT used?",
    "Explain classful IP addressing.",
    "Explain TCP 3-way handshake.",
    "Explain reverse proxy vs forward proxy.",
    "What are the components of a TLS certificate?",
    "Explain the Authorization Code Flow in OAuth2.",
    "What files are required to configure HTTPS on a server?",
    "What is the difference between AWS IAM Role and Policy?",
    "What is the difference between Security Groups and Network ACLs?"
  ],
  "OS": [
    "Explain page replacement algorithms.",
    "Explain virtualization.",
    "Explain the limitations of multitasking systems.",
    "Explain single-process systems.",
    "Explain contiguous memory allocation.",
    "What is a system call?",
    "Explain CPU scheduling.",
    "Explain disk access time.",
    "Why is context switching between threads faster than between processes?",
    "Is having more threads, processes, and cores always better?"
  ],
  "Security": [
    "Explain the features and caveats of JWT.",
    "Explain CSRF attacks.",
    "Explain symmetric key vs asymmetric key encryption.",
    "Explain HTTPS."
  ],
  "SystemDesign": [
    "What is a CDN?",
    "What is the CQRS pattern?",
    "Explain the Transactional Outbox Pattern.",
    "Explain the CAP theorem.",
    "What asynchronous communication methods exist between systems?",
    "Explain caching strategies.",
    "Explain load balancing.",
    "What problems can occur when using session-based authentication in a multi-server environment?",
    "Explain scale-out vs scale-up.",
    "What is SPOF (Single Point of Failure)?",
    "How can you handle failures when calling external services synchronously?",
    "What is Serverless?"
  ],
  "Linux": [
    "Explain the difference between processes and threads in Linux.",
    "What does Load Average mean? What do the 1/5/15-minute averages represent?",
    "What is a zombie process in Linux?",
    "What’s the difference between crontab and systemd timer?",
    "What effect does ulimit have on a system?"
  ],
  "Docker": [
    "Explain the difference between a Docker image and a container.",
    "Why use multi-stage builds in a Dockerfile?",
    "How would you analyze a container that keeps slowing down?",
    "How are process PIDs inside a container mapped on the host?",
    "What’s the difference between containers and virtual machines?"
  ],
  "DevOps": [
    "Explain Infrastructure as Code (IaC).",
    "What is zero-downtime deployment?",
    "Why is Graceful Shutdown necessary?",
    "Explain CI/CD pipelines."
  ],
  "Observability": [
    "What are the roles of Prometheus and Grafana?",
    "Explain the differences between metrics, logs, and traces.",
    "What should be considered when designing alerting conditions?",
    "What’s the difference between SLO and SLA?",
    "When would you use a Blackbox Exporter?"
  ],
  "Concurrency": [
    "Explain multithreading.",
    "What must be guaranteed to solve race conditions in concurrency?",
    "Explain deadlocks.",
    "Explain concurrency vs parallelism.",
    "What’s the difference between synchronous and asynchronous?",
    "What is the difference between GitOps and traditional CI/CD?",
    "What is the difference between Jenkins and GitHub Actions?",
    "Explain the difference between Canary deployment and Blue-Green deployment.",
    "How can you prevent moving to the next stage in CI if unit tests fail?",
    "What does 'Shift Left' mean in DevOps culture?"
  ],
  "Algorithm": [
    "Explain binary trees.",
    "Explain the Trie data structure.",
    "What’s the difference between time complexity and space complexity?",
    "Explain hash collisions.",
    "Explain the stack data structure."
  ],
  "SoftwareDesign": [
    "Explain the Strategy Pattern.",
    "Explain functional programming.",
    "Explain cohesion and coupling.",
    "Explain the SOLID principles.",
    "What is a value object collection (First-Class Collection)?"
  ],
  "Testing": [
    "Explain test doubles.",
    "Explain code coverage.",
    "What is Test-Driven Development?",
    "What’s the difference between unit tests and integration tests?"
  ],
  "Cloud": [
    "What’s the difference between EC2 and Lambda?",
    "How does S3 store data and ensure high availability?",
    "When is Multi-AZ setup needed in RDS?",
    "Explain the relationship between VPC, Subnet, and Route Table.",
    "Explain how to configure monitoring with CloudWatch."
  ]
}
